{
  "site": {
    "title": "jean-philippe is awesome",
    "description": "Here is the description of my awesome website!",
    "button-show-case": "showcase",
    "button-repo": "repository"
  },
  "home": {
    "title": "Welcome to my awesome website!",
    "subtitle": "This is a <0>more complex</0> string to translate, mixed with <1>html elements</1>, such as a <2>a cool link</2>!",
    "hi-there": "Hey there 👋",
    "i-am":  "I'm Jean-Philippe Martel",
    "i-do": " I'm a software developper  from Quebec city, Canada. I'm passionate about building great software and helping others do the same. I'm currently working on a few projects, I'm  big fan of new technologies and I'm always looking for new  improvements to make my life easier.",
    "latest-project": "Latest project",
    "my-title": "Software developer",
    "connect": "Let's connect",
    "projects": {
       "trans" : {
        "title": "Transcendence",
        "desc": " Final project for the 42 school; full stack web application that lets you play with other people  in real time to pong Made with React, Node.js, Express, Socket.io, and PostgreSQL. and of course of Typescript.",
        "link": "https://tranjs.com"
      },
       "webserv" : {
        "title": "Webserv",
        "desc": "webserv is a web server written in C++ that supports HTTP/1.1 and CGI. It is able to handle multiple simultaneous connections and is able to serve static files and dynamic content. It is also able to handle multiple hosts and multiple locations per host.",
        "link": "https://tranjs.com"
      },
       "Cube3d" : {
        "title": "Cube3D",
        "desc": "Cube3D is 2d raycasting game engine written in C. It is able to render walls, floors and ceilings, and is able to handle multiple sprites. It is also able to handle multiple maps and multiple textures. ",
        "link": "https://tranjs.com"
      }
    }
    },
   "projects": {
    "title": "Projects details  least techincal possible",
    "subtitle": "Here is a list of my projects"
  },
   "resume" : {
    "intro" :  "I'm a software developer from Quebec city, Canada. I'm passionate about building great software and helping others do the same. I'm currently working on a few projects, I'm  big fan of new technologies and I'm always looking for new  improvements to make my life easier.",
    "educ": "Education",
    "timeline" : {
     "highschool" : {
       "title" : " High school",
        "subtitle" : "subtitle"
    },
    "professional" : {
          "title" : "Mechanial Timber  Harvesting certificate",
          "subtitle" : "learned how to operate a harvester and a forwarder and how to fell tree"
    },
    "covid" : {
          "title" :  "self taught programming during covid-19",
          "subtitle" : "during the pandemic i  begin my journey in programming and i learned a lot of things from the basics from the web and also books while building little  mini projects; I learned vim,git and linux and also how to use the terminal and how to use the internet to find solutions to my problems."
    },  
    "school42" : {
          "title" : "School 42",
          "subtitle" : "during the March 2021 intake, I was accepted into the 42 school in Quebec,    I learned alot about structed programming and how to think like a computer and how to solve problems in a logical way.All of this without any teacher only other students and the internet to help me. It was a great way to learn and I'm very happy to be  in this school."
    },
      "work" : {
        "skill" : "Skills",
      "experience" : "Experience",
     "zelexio" : {
          "title" : "Developer Full Stack",
          "subtitle" : "as a Developer  at Zelexio i implemnted new features on there existing platform that were requested by the product owner who in this case was the CEO of the Startup. I also provided support for the existing plaform",
          "desc" : ""
    }
  }
   },
  "hobbies": {
    "hobbie" : "Hobbies",
     "climbing" : {
       "title" : "Boldering",
        "subtitle" : "I pratice boldering  in my free time it  such a great way to combine physical activity and mental activity and it's a great way to meet new people and to have fun."
      },
     "biking" : {
       "title" : "Biking",
        "subtitle" : "Biking is the i  way  it commuting all year long. During the summmer i take out my 'nice' bike and try to pump out some pr on strava and also just ride for fun around the city."
      },
      "running" : {
       "title" : "Running",
        "subtitle" : "whenever i feel like i need to get some fresh air i go out for a run. But not simply the flat run, i like to run up hill and get some good cardio in."
      }
   }
  }
}